chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mx440f128l.h
PLIB_INLINE_API uint16_t PLIB_TMR_Period16BitGet(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_Period16BitGet_Default(index);
        case TMR_ID_2 :
            return TMR_Period16BitGet_Default(index);
        case TMR_ID_4 :
            return TMR_Period16BitGet_Default(index);
        case TMR_ID_3 :
            return TMR_Period16BitGet_Default(index);
        case TMR_ID_5 :
            return TMR_Period16BitGet_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsPeriod16Bit(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsPeriod16Bit_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsPeriod16Bit_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsPeriod16Bit_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsPeriod16Bit_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsPeriod16Bit_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Period32BitSet(TMR_MODULE_ID index, uint32_t period)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Period32BitSet_Unsupported(index, period);
            break;
        case TMR_ID_2 :
            TMR_Period32BitSet_In16BitRegister_pic32(index, period);
            break;
        case TMR_ID_4 :
            TMR_Period32BitSet_In16BitRegister_pic32(index, period);
            break;
        case TMR_ID_3 :
            TMR_Period32BitSet_In16BitRegister_high(index, period);
            break;
        case TMR_ID_5 :
            TMR_Period32BitSet_In16BitRegister_high(index, period);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint32_t PLIB_TMR_Period32BitGet(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_Period32BitGet_Unsupported(index);
        case TMR_ID_2 :
            return TMR_Period32BitGet_In16BitRegister_pic32(index);
        case TMR_ID_4 :
            return TMR_Period32BitGet_In16BitRegister_pic32(index);
        case TMR_ID_3 :
            return TMR_Period32BitGet_In16BitRegister_high(index);
        case TMR_ID_5 :
            return TMR_Period32BitGet_In16BitRegister_high(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsPeriod32Bit(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsPeriod32Bit_Unsupported(index);
        case TMR_ID_2 :
            return TMR_ExistsPeriod32Bit_In16BitRegister_pic32(index);
        case TMR_ID_4 :
            return TMR_ExistsPeriod32Bit_In16BitRegister_pic32(index);
        case TMR_ID_3 :
            return TMR_ExistsPeriod32Bit_In16BitRegister_high(index);
        case TMR_ID_5 :
            return TMR_ExistsPeriod32Bit_In16BitRegister_high(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_CounterAsyncWriteEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_CounterAsyncWriteEnable_Default(index);
            break;
        case TMR_ID_2 :
            TMR_CounterAsyncWriteEnable_Unsupported(index);
            break;
        case TMR_ID_4 :
            TMR_CounterAsyncWriteEnable_Unsupported(index);
            break;
        case TMR_ID_3 :
            TMR_CounterAsyncWriteEnable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_CounterAsyncWriteEnable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_TMR_CounterAsyncWriteDisable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_CounterAsyncWriteDisable_Default(index);
            break;
        case TMR_ID_2 :
            TMR_CounterAsyncWriteDisable_Unsupported(index);
            break;
        case TMR_ID_4 :
            TMR_CounterAsyncWriteDisable_Unsupported(index);
            break;
        case TMR_ID_3 :
            TMR_CounterAsyncWriteDisable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_CounterAsyncWriteDisable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsCounterAsyncWriteControl(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsCounterAsyncWriteControl_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_4 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_3 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_CounterAsyncWriteInProgress(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_CounterAsyncWriteInProgress_Default(index);
        case TMR_ID_2 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_4 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_3 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_5 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

